Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: དེ་དག་ལ་སྩོགས་པ་མངོན་པར་ཤེས་པ་དང་། ཡེ་ཤེས་ཆེན་པོའི་སྒོའི་ཏིང་ངེ་འཛིན་ས་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པ།
en: He enters a million samādhis that are perfected, are doorways to clairvoyance and wisdom, and purify the bhūmi.

source: བརྒྱ་སྟོང་ཕྲག་བཅུ་ཚང་བ་ལ་སྙོམས་པར་འཇུག་གོ །དེ་ཐབས་དང་། ཤེས་རབ་ཀྱིས་ཡོངས་སུ་སྦྱངས་པའི་ཏིང་ངེ་འཛིན་དེ་དག་རབ་ཏུ་ཐོབ་པ་དང་། སྙིང་རྗེ་དང་སྙིང་བརྩེ་བའི་མཐུས་ཉན་ཐོས་ཀྱི་ས་ལས་འདས་པ་ཡིན། རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་པ་ཡིན། ཤེས་རབ་དང་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་དཔྱད་པའི་ས་མངོན་སུམ་དུ་གྱུར་པ་ཡིན།
en: “Having attained these samādhis that are purified by method and wisdom, he transcends through the power of compassion and kindness the bhūmi of the śrāvakas and pratyekabuddhas and approaches the bhūmi of discrimination by wisdom and knowledge.

source: དེ་ལྟར་དེ་བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་འདི་ལ་གནས་པའི་ཚེ། ལུས་ཀྱི་ལས་ཚད་མེད་པ་མཚན་མ་དང་བྲལ་བ་རབ་ཏུ་འབྱུང་ངོ་། །ངག་གི་ལས་ཚད་མེད་པ་མཚན་མ་དང་བྲལ་བ་རབ་ཏུ་འབྱུང་ངོ་། །ཡིད་ཀྱི་ལས་ཚད་མེད་པ་མཚན་མ་དང་བྲལ་བ་ཤིན་ཏུ་རྣམ་པར་སྦྱངས་བ་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པས་སྣང་བར་གྱུར་བ་ཚད་མེད་པ་རབ་ཏུ་འབྱུང་ངོ་།
en: “When he is on the seventh bodhisattva bhūmi in this way, there are limitless physical activities that are devoid of features, limitless vocal activities that are devoid of features, and limitless mental activities that are devoid of features, and there is the pure arising of the acceptance of the birthlessness of phenomena.”

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གྲོལ་བའི་ཟླ་བས་སྨྲས་པ།
en: The bodhisattva Vimukti­candra asked, “O jinaputra!

source: ཀྱེ་རྒྱལ་བའི་སྲས་དེ་ལྟ་གོ་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་ལ་གནས་པའི་ཚེ་འང་བྱང་ཆུབ་སེམས་དཔའི་ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་ཚད་མེད་པ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སྤྱོད་པ་ལས་ཡང་དག་པར་འདས་ན་ཇི་རོབ།
en: Do not the limitless physical, vocal, and mental actions of the bodhisattva on the first bodhisattva bhūmi also transcend the conduct of all śrāvakas and pratyekabuddhas?”

source: བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས་སྨྲས་པ། ཀྱེ་རྒྱལ་བའི་སྲས་དེ་ལྟའང་མ་ཡིན་ཏེ།
en: The bodhisattva Vajra­garbha answered, “O jinaputras!

source: དེ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ལ་དམིགས་པའི་མཐུར་ཟད་ཀྱི་རང་གི་བློ་ས་རྣམ་པར་དཔྱད་པ་ནི་མ་ཡིན་ནོ།
en: That is so, but that is simply because of the power of his focus on the Dharma of the Buddha, and not because of his own understanding’s discernment.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པོ་འདི་ལ་ནི་རང་གི་བློའི་སྤྱོད་ཡུལ་རྣམ་པར་དཔྱོད་པ་རབ་ཏུ་ཐོབ་པས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་མི་འཕྲོགས་པ་ཡིན།
en: On this seventh bodhisattva bhūmi, however, it is attained through the mind’s analysis of the field of experience, which cannot be superseded by all the śrāvakas and pratyekabuddhas.

source: ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན།
en: “O jinaputras!

source: རྒྱལ་པོའི་རིགས་སུ་སྐྱེས་པའི་རྒྱལ་པོའི་བུ་རྒྱལ་པོའི་མཚན་དང་ལྡན་པ་ནི་བཙས་མ་ཐག་ཏུ་རྒྱལ་པོའི་བྱིན་གྱིས་བློན་པོའི་ཚོགས་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་གྱི།
en: By analogy, when a prince is born in a royal family and is endowed with the characteristics of royalty, he is immediately superior to the ministers.

source: རང་གི་བློས་རྣམ་པར་དཔྱད་པས་ནི་མ་ཡིན་ནོ།
en: This is because of the sovereignty of the king, and not because of his own understanding’s discernment.

source: །ནམ་ནར་སོན་པར་གྱུར་པ་དེའི་ཚེ། རང་གི་བློའི་མཐུས་བློན་པོ་ཐམས་ཅད་ཀྱི་བྱེད་པའི་ཚུལ་ལས་ཤིན་ཏུ་འདས་པ་ཡིན།
en: However, when he has become an adult, he transcends the activities of all the ministers through the power of his own intelligence.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་དུ།
en: “O jinaputras!

source: བྱང་ཆུབ་སེམས་དཔའ་འང་སེམས་བསྐྱེད་མ་ཐག་ཏུ་ལྷག་པའི་བསམ་པའི་བདག་ཉིད་ཆེན་པོས། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཏེ།
en: In that same way, as soon as the bodhisattva has developed his motivation, he surpasses all śrāvakas and pratyekabuddhas.

source: རང་གི་བློས་རྣམ་པར་བརྟགས་པ་ནི་མ་ཡིན་ནོ།
en: This is because of the greatness of his higher intention and not because of his own understanding’s discernment.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་རང་གི་ཡུལ་གྱི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱི་ཤུགས་ཀྱིས། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་བྱེད་པའི་ཚུལ་ལས་ཤིན་ཏུ་འདས་པ་ཡིན་ནོ།
en: The bodhisattva who is on this seventh bodhisattva bhūmi completely surpasses the activities of all śrāvakas and pratyekabuddhas through the greatness of his own wisdom’s analysis of his field of experience.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་འདི་ལ་གནས་པའི་ཚེ། ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ལས་ཟབ་ཅིང་དབེན་ལ་རྒྱུ་བ་མེད་པ་དང་ལྡན་པ་འང་རབ་ཏུ་ཐོབ་པ་ཡིན་ཏེ།
en: The bodhisattva on this seventh bodhisattva bhūmi also attains activity of body, speech, and mind that is profound, detached, and does not wander.

source: ཁྱད་པར་གོང་དུ་བཙལ་བའི་བརྩོན་འགྲུས་ཀྱང་ཡོངས་སུ་མི་གཏོང་ངོ་། །ཡོངས་སུ་བཙལ་བའི་བརྩོན་འགྲུས་དེས་ཀྱང་ཡང་དག་པའི་མཐར་གནས་པ་ལ་གནས་ཏེ།
en: Furthermore, he does not desist from his perseverance in the excellent path.

source: ཁྱད་པར་གོང་མ་ཤིན་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར། ཡང་དག་པའི་མཐའ་མངོན་དུ་འང་མི་བྱེད་དོ།
en: Through that perseverance on the excellent path he attains cessation, but he does not manifest cessation.”

source: ཀྱེ་རྒྱལ་བའི་སྲས་བྱང་ཆུབ་སེམས་དཔའི་ས་གང་ཡན་ཅད་དུ།
en: Above which bodhisattva bhūmi does the bodhisattva enter cessation?”

source: བྱང་ཆུབ་སེམས་དཔའི་འགོག་པ་ལ་སྙོམས་པར་འཇུག །བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས་སྨྲས་པ། ཀྱེ་རྒྱལ་བའི་སྲས་བྱང་ཆུབ་སེམས་དཔའི་ས་དྲུག་པ་ཡན་ཅད། བྱང་ཆུབ་སེམས་དཔའི་འགོག་པ་ལ་སྙོམས་པར་འཇུག་སྟེ།
en: The bodhisattva Vajra­garbha replied, “The bodhisattva enters cessation above the sixth bodhisattva bhūmi.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་སྐད་ཅིག་རེ་རེ་ལ་ཡང་འགོག་པ་ལ་སྙོམས་པར་འཇུག་སྟེ། འགོག་པ་མངོན་དུ་བྱས་ཤེས་ནི་མི་བྱའོ།
en: The bodhisattva who is on this seventh bodhisattva bhūmi enters and remains in cessation in each instant but does not manifest cessation.

source: །དེ་བས་ན་དེ་ནི་བསམ་གྱིས་མི་ཁྱབ་པའི་ལུས་དང་། ངག་དང་ཡིད་ཀྱི་ལས་དང་ལྡན་ཞེས་བྱ་བ་ཡིན་ནོ།
en: Therefore, he is said to possess inconceivable physical, vocal, and mental activity.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པའི་མཐའ་ལ་གནས་པས་ཀྱང་། གནས་ལ་ཡང་དག་པའི་མཐའ་མངོན་དུ་ཡང་མི་བྱེད་པ་ནི་ངོ་མཚར་ཆེའོ།
en: “O jinaputras! It is thus wondrous that the bodhisattva dwells in the final conclusion, yet does not manifest cessation.

source: མི་ལ་ལ་ཞིག་རྒྱ་མཚོ་ཆེན་པོའི་གྲུ་ཆེན་པོར་ཞུགས་ཏེ་རྒལ་བའི་ཐབས་ལ་མཁས་ཤིང་རླུང་ལ་མཁས་པ་དང་། ཆུ་ལ་མཁས་པ་ནི་རྒྱ་མཚོ་ཆེན་པོའི་ཆུའི་ཉེས་པས་མི་གོས་སོ། །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ།
en: It is like when a clever, wise, learned, intelligent man who knows the qualities of the water, endowed with the power of analysis, sails in great ships upon the great ocean. He is wise concerning the winds and is wise concerning the water. He is not subject to harm from the great ocean’s water. “O jinaputras!

source: བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་འདི་ལ་གནས་ཤིང་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གྲུ་ཆེན་པོར་ཞུགས་པ་ཡང་ཡང་དག་པའི་མཐའ་ལ་གནས་པས་ཀྱང་གནས་ལ་ཡང་དག་པའི་མཐའ་མངོན་དུ་ཡང་མི་བྱེད་དོ་དེ་ལྟར་དེ་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་ཤུགས་ཐོབ་པ་ནི་ཏིང་ངེ་འཛིན་དང་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་ཤུགས་ཀྱིས་མངོན་པར་བསྒྲུབ་པའི་བློ་དང་ཐབས་དང་ཤེས་རབ་ཀྱི་སྟོབས་དང་ཤུགས་ཆེན་པོས་འཁོར་བའི་སྒོ་ཡང་སྟོན་ལ་མྱ་ངན་ལས་འདས་པའི་བསམ་པ་དང་ཡང་མི་འབྲལ་བ་ཡིན་འཁོར་མང་པོས་ཀུན་ནས་བསྐོར་བར་སྣང་ཡང་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་སེམས་ཀྱི་དབེན་པ་ཡང་རབ་ཏུ་ཐོབ་པ་ཡིན།
en: In that same way the bodhisattva who is on this seventh bodhisattva bhūmi travels upon the great ocean of omniscient wisdom and sails in the great ship of the perfections, and though he dwells in the final conclusion, he does not manifest cessation. “Thus he has attained the strength and power of wisdom, and with the realization obtained through the power of samādhi and wisdom, and with the power of great method and wisdom, he teaches what is the doorway to saṃsāra, but he constantly aspires to nirvāṇa. A great assembly of followers encircles him, but he always maintains a detached mind.

source: ཁམས་གསུམ་དུ་སྐྱེ་བ་ཡང་སྨོན་ལམ་གྱི་དབང་གིས་མངོན་པར་སྒྲུབ་ལ་འཇིག་རྟེན་གྱི་ཉེས་པས་ཀྱང་མི་གོས་པ་ཡིན།
en: Through the power of his aspiration he accomplishes rebirth within the three realms in order to ripen beings, but he is not affected by the harms of the world.

source: ཞི་ཞིང་རབ་ཏུ་ཞི་བ་འང་ཡིན་ལ་ཐབས་ཀྱིས་ཀྱང་རབ་ཏུ་འབར་ཏེ།
en: He is calm, tranquil, and serene.

source: དེ་ལྟར་འབར་ཡང་ཚིག་པར་མི་འགྱུར་བ་ཡིན།
en: He is ablaze with methods but is not burned by that blazing.

source: སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལའང་ཡོངས་སུ་འཇུག་ལ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལས་ཀྱང་ཕྱིར་མི་ལྡོག་པ་ཡིན།
en: He comprehends the Buddha’s wisdom, and he will not revert to the bhūmi of the śrāvakas and pratyekabuddhas.

source: སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་མཐིལ་དུ་ཡང་ཕྱིན་ལ་བདུད་ཀྱི་ཡུལ་ན་འང་འདུག་པར་སྣང་བ་ཡིན།
en: He has reached the center of the Buddha’s realm but appears to be in the realm of the māras.

source: བདུད་ཀྱི་ལམ་བཞི་ལས་ཀྱང་ཡང་དག་པར་འདས་ལ་བདུད་ཀྱི་ཡུལ་དང་སྤྱོད་ཡུལ་ཡང་ཡང་དག་པར་སྟོན་པ་ཡིན།
en: He has transcended the paths of the four māras and yet appears to be within the realm and range of activity of the māras.

source: མུ་སྟེགས་ཅན་གྱི་གནས་ཐམས་ཅད་ན་འང་འདུག་པར་སྣང་ལ། སངས་རྒྱས་ཀྱི་མུ་སྟེགས་ཀྱི་གནས་ཀྱི་བསམ་པ་ཡང་། མི་གཏོང་བ་ཡིན།
en: He appears to enter into all religious traditions, but he never abandons the tradition of the Buddha.

source: འཇིག་རྟེན་གྱི་བྱ་བ་ཐམས་ཅད་དང་ཡང་ལྡན་པར་སྣང་ལ། འཇིག་རྟེན་ལས་འདས་པའི་ཚུལ་ལ་ཡང་ཡང་དག་པར་གཞོལ་བ་ཡིན།
en: He appears to engage in all worldly activities, but he follows the way of the Dharma that transcends the world.

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། མི་དང་མི་མ་ཡིན་པ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་གྱི་མགོན་པོ་ཐམས་ཅད་ལས་ལྷག་པའི་རྒྱན་དང་ལྷབ་ལྷུབ་ཤིན་ཏུ་བསྒྲུབ་པ་ཡང་རབ་ཏུ་ཐོབ་ལ། ཆོས་ལ་དགའ་བ་ཡིད་ལ་བྱ་བ་འང་མི་སྤོང་བ་ཡིན།
en: He attains the creation of an array of realm adornments that surpass those of all devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans and nonhumans, Śakra, Brahmā, and all lokapālas, but his mind never ceases rejoicing in the entire Dharma of the Buddha.

source: དེ་ལྟར་དེ་ལྟ་བུའི་ཡེ་ཤེས་དང་ལྡན་པར་བྱང་ཆུབ་སེམས་དཔའི་ས་རིང་དུ་སོང་བ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ལྟ་བ་རྒྱ་ཆེན་པོ་དང་། སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་སངས་རྒྱས་མང་པོ་སྣང་བར་འགྱུར་ཏེ།
en: “In that way, possessing that kind of wisdom, the bodhisattva who is on the seventh bodhisattva bhūmi, Gone Far, because of his vast view and the power of his prayers, will have many buddhas appear to him.

source: ལྟ་བ་རྒྱ་ཆེན་པོ་དང་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས། སངས་རྒྱས་བརྒྱ་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་སྣང་བར་འགྱུར་རོ།
en: Because of his vast view and the power of his prayers, many hundreds of buddhas, many thousands of buddhas, many hundreds of thousands of buddhas, many millions of buddhas, many tens of millions of buddhas, many billions of buddhas, many tens of billions of buddhas, many trillions of buddhas, and many quintillions of buddhas will appear to him.

source: །དེས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་མཐོང་ནས་བསམ་པ་རྒྱ་ཆེན་པོས་རིམ་གྲོ་བྱེད་དོ། །བཀུར་སྟི་བྱེད་དོ། །བསྟི་སྟང་བྱེད་དོ། །མཆོད་པ་བྱེད་དོ། །ན་བཟའ་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་སྙུན་གྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་དག་ཀྱང་འབུལ་ཞིང་།
en: “He will see those tathāgata arhat samyak­sambuddhas, and with a vast motivation he will serve them, worship them, honor them, make offerings to them, supply them with robes, alms, bowls, beds, medicine for when they are ill, and implements.

source: དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ། །དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་བསྙེན་བཀུར་བྱེད་ཅིང་།
en: He will dedicate all those roots of goodness to the highest complete enlightenment.

source: དེ་དག་ལས་རྗེས་དང་རིམ་གྲོས་ནན་ཏན་དུ་ཆོས་བསྟན་པ་ཉན་ཅིང་ལེན་ཏོ་འཛིན་ཏོ།
en: “He will see and honor those tathāgatas, those arhats, those samyak­sambuddhas, and he will serve, listen to, and acquire and hold their teachings.

source: །ཐོས་ནས་ཀྱང་མ་ནོར་བའི་སྙོམས་པར་འཇུག་པ་དང་། ཤེས་རབ་དང་ཡེ་ཤེས་ཀྱི་སྣང་བས་རབ་ཏུ་བརྩོན་པར་བྱེད་ཅིང་ནན་ཏན་གྱིས་ཡོངས་སུ་འཛིན་ཏོ།
en: Having heard their teachings, he applies himself to them with the light of correct meditation, wisdom, and knowledge. He maintains them through practice.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་བསྟན་པ་ཡང་ཡང་དག་པར་འཛིན་ཏོ།
en: He becomes a holder of the teachings of the buddha bhagavats.

source: །ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་མངོན་པར་རྟོགས་པ་ཡོངས་སུ་དྲི་བས་ཀྱང་མི་འཕྲོགས་པ་ཡིན་ཏེ།
en: He is not sullied by the stains of the realizations of the śrāvakas and pratyekabuddhas.

source: དེ་སྔོན་པས་ཀྱང་སེམས་ཅན་ལ་ཕན་འདོགས་པའི་ཆོས་ཀྱི་བཟོད་པ་རྣམ་པར་དག་པར་འགྱུར་བ་ཡིན།
en: Even more than before, he has the pure patience of phenomena that benefits beings.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ས་རིང་དུ་སོད་པ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེའི་དགེ་བའི་རྩ་བ་དེ་དག་སྔོན་བས་ཀྱང་བསྐལ་པ་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མར་ཤིན་ཏུ་དག་ཅིང་ཡོངས་སུ་བྱང་བར་གནས་སོ། །ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན།
en: “In that way the roots of goodness of the bodhisattva who is on the bodhisattva bhūmi Gone Far will, even more than before, remain pure and purified for many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, many millions of eons, many tens of millions of eons, many billions of eons, many tens of billions of eons, many trillions of eons, and many quintillions of eons. “O jinaputras!

source: གསེར་གྱི་ས་ལེ་སྦྲམ་དེ་ཉིད་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་རབ་ཏུ་སྤྲས་པ་ནི་སྔོན་བས་ཀྱང་།
en: This is like when gold is adorned with all jewels, even more than before:

source: རྒྱན་གྱི་རྣམ་པ་གཞན་དང་གཞན་གྱིས་མི་ཐུབ་པ་དང་། ཆེས་འོད་གསལ་ཞིང་དང་བར་འགྱུར་རོ།
en: it cannot be equaled by any other adornment, and it becomes brighter and clearer.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ།
en: “O jinaputras!

source: བྱང་ཆུབ་སེམས་དཔའི་ས་རིང་དུ་སོང་བ་འདི་ལ་གནས་པའི་ཐབས་དང་ཤེས་རབ་ཀྱིས་བསྒྲུབས་པའི་དགེ་བའི་རྩ་བ་དེ་དག་སྔོན་བས་ཀྱང་ཆེས་ཤིན་ཏུ་བྱང་བ་དང་། ཆེས་འོད་གསལ་ཞིང་དང་བར་འགྱུར་རོ།
en: In that same way the roots of goodness accomplished by method and wisdom by the bodhisattva mahāsattva who is on this seventh bodhisattva bhūmi, Gone Far, become purer, brighter, and clearer.

source: །ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཀྱང་མི་འཕྲོགས་པ་ཡིན།
en: They cannot be taken away by all the śrāvakas and pratyekabuddhas.

source: ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན་ཉི་མའི་འོད་ནི་སྐར་མའི་ཚོགས་དང་ཟླ་བའི་འོད་ཀྱིས་མི་འཕྲོགས་ཤིང་འཛམ་བུའི་གླིང་ན་རླན་གྱི་བག་ཡོད་པ་ཐམས་ཅད་ཀྱང་ཤིན་ཏུ་སྐེམ་པར་བྱེད་དོ།
en: “O jinaputras! It is like sunlight, which cannot be surpassed by the light of the stars or the light of the moon, dries everything that is moist in Jambudvīpa, and ripens all grains.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་རིང་དུ་སོང་བ་འདི་ལ་གནས་པའི། བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་སྔོན་བས་ཀྱང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས། མི་འཕྲོགས་པ་ཡིན།
en: In that same way, the roots of goodness of the bodhisattva who is on the seventh bodhisattva bhūmi, Gone Far, will be even more unsurpassable by all the śrāvakas and pratyekabuddhas;

source: ཕྱིན་ཅི་ལོག་བཞི་དང་ལྡན་པའི་ཉོན་མོངས་པའི་རླན་གྱི་རྣམ་པ་ཐམས་ཅད་ཀྱང་། ཡོངས་སུ་སྐེམ་མོ།
en: and they dry up, even more than before, all the moisture of the kleśas and the four misconceptions.

source: དེའི་ཕ་རོལ་དུ་ཕྱིན་པ་བཅུ་ལས། ཐབས་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཤས་ཆེ་བ་ཡིན་ཏེ། ལྷག་མ་རྣམས་ཀྱང་ཅི་ཚུལ་ཅི་ནུས་སུ་མི་བསྒྲུབ་པ་མ་ཡིན་ནོ།
en: “From among the ten perfections, the perfection of skill in methods predominates, and the other perfections are not accomplished fully and completely.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ནི།
en: “O jinaputras!

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི། རིང་དུ་སོང་བ་ཞེས་བྱ་བ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་མདོར་བསྟན་པའོ།
en: That, in brief, is Gone Far, the seventh bodhisattva bhūmi of the bodhisattva mahāsattvas.

source: །དེ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི། ཕལ་ཆེར་ལྷའི་རྒྱལ་པོ་དབང་སྒྱུར་དུ་འགྱུར་ཏེ།
en: Most of the bodhisattva mahāsattvas who are on that bhūmi become the deva king Vaśavartin.

source: སེམས་ཅན་རྣམས་ལ། མངོན་པར་རྟོགས་པའི་ཡེ་ཤེས་ཡང་དག་པར་བསྟབས་པ་ལ་མཁས་ཤིང་མཐུ་ཡོད་པ་སྟེ།
en: He is wise and powerful in bringing the wisdom of realization to beings.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས། ཡོངས་སུ་དྲི་བས་མི་ཟད་པ་ཡིན།
en: He is not constrained by questions from any śrāvaka or pratyekabuddha.

source: སེམས་ཅན་སྐྱོན་མེད་པར་ཤིན་ཏུ་བསླབ་པར་བྱ་བ་ལ་འང་མཁས་པ་ཡིན་ཏེ། སྦྱིན་པ་འམ། ངག་སྙན་པ་འམ། དོན་བསྒྲུབ་པ་འམ། དོན་འཐུན་པས།
en: He is also skilled in teaching beings without error.

source: དགེ་བའི་རྩ་བ་གང་ཅི་རྩོམ་ཡང་རུང་སྟེ། དེ་ཐམས་ཅད་ཇི་ལྟར་ན། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོག་ཏུ་འགྱུར། གཙོ་བོར་འགྱུར། ཐུ་བོར་འགྱུར། ཕུལ་དུ་འགྱུར། དམ་པར་འགྱུར། བླ་ན་མེད་པར་འགྱུར།
en: “In whatever roots of goodness he accomplishes through generosity, kind words, actions that benefit others, and practicing what he preaches, he becomes supreme, the best, the foremost, the highest, the most excellent, the unsurpassable, the guide, the leader, the commander, and so on, up until becoming the omniscient one who is relied on.

source: འདྲེན་པར་འགྱུར། ཡོངས་སུ་འདྲེན་པར་འགྱུར་བ་ནས། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་རྟེན་པའི་བར་དུ་འགྱུར་སྙམ་སྟེ། སངས་རྒྱས་ཡིད་ལ་བྱ་བ་དང་། ཆོས་ཡིད་ལ་བྱ་བ་དང་། དགེ་འདུན་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཡིད་ལ་བྱ་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིད་ལ་བྱ་བ་དང་། སྟོབས་ཡིད་ལ་བྱ་བ་དང་། མི་འཇིགས་པ་ཡིད་ལ་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཡིད་ལ་བྱ་བ་ནས། རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་བར་དུ་ཡིད་ལ་བྱ་བ་དང་མི་འབྲལ་བ་ཡིན་ཏེ།
en: His mind is always focused on the Buddha, focused on the Dharma, focused on the Saṅgha, focused on the bodhisattvas, focused on bodhisattva conduct, focused on the bodhisattva bhūmis, focused on the perfections, focused on the strengths, focused on the confidences, focused on the unique qualities of buddhahood, and so on, up until being focused on the omniscient wisdom endowed with the supreme aspects.

source: དེ་འདོད་ན་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ། ཏིང་ངེ་འཛིན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་རབ་ཏུ་ཐོབ་ཅིང་དེ་དག་ལ་སྙོམས་པར་འཇུག་པ་དང་། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མཐོང་བ་དང་། དེ་དག་གི་བྱིན་གྱི་རླབས་ཀྱང་ཡང་དག་པར་ཤེས་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་སྣང་བར་བྱ་བ་དང་། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་གནས་པར་བྱ་བ་དང་། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་ལ་རབ་ཏུ་འཇུག་པ་དང་། ཆོས་ཀྱི་སྒོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་རྣམ་པར་འབྱེད་པ་དང་། ལུས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཡོངས་སུ་བསྟན་པ་དང་། ལུས་རེ་རེ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཡང་དག་པར་བསྟན་པར་བྱ་བའི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པ་དེ་ལྟ་བུ་རྩོམ་མོ། །དེ་ཡན་ཅད་བྱང་ཆུབ་སེམས་དཔའ་སྨོན་ལམ་གྱི་མཐུ་ཅན་རྣམས་སྨོན་ལམ་གྱི་ཁྱད་པར་གྱིས་རྣམ་པར་འཕྲུལ་ཏེ། དེ་དག་གི་ལུས་སམ་འོང་དམ། རྫུ་འཕྲུལ་ལམ། མྱིག་གམ། སྤྱོད་ཡུལ་ལམ། དབྱངས་སམ།
en: “If he wishes to, he can apply himself in such a way that in just one instant he attains and rests in a quintillion samādhis, sees a quintillion buddhas and knows their blessings, causes a quintillion worlds to shake, goes to a quintillion buddha realms, illuminates a quintillion worlds, ripens a quintillion beings, remains for a quintillion eons, comprehends a quintillion previous eons and a quintillion future eons, opens a quintillion Dharma doors, manifests a quintillion bodies, and manifests each body having a retinue of a quintillion bodhisattvas.

source: སྤྱོད་པ་འམ། རྒྱན་ཏམ། བྱིན་གྱི་རླབས་སམ། མོས་པ་འམ། མངོན་པར་འདུ་བྱེད་པ་དག་ཀྱང་བསྐལ་པ་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་བར་གྱིས་ཀྱང་བགྲང་བར་དཀའོ།
en: “From this time onward the bodhisattvas who have the power of prayer through particular prayers manifest bodies, light, miracles, sights, activities, voices, conduct, displays, blessings, transformations, and manifestations for many eons, for many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, and so on, until many quintillions of eons, which are difficult to enumerate.”

source: །ཡེ་ཤེས་ཟབ་མོ་དོན་དམ་ཚིག་གི་རྗེས་སྙེགས་ཤིང་།
en: “Following after profound ultimate wisdom

source: །ས་དྲུག་རྟོགས་པའི་ཡིད་ལྡན་བདག་ཉིད་མཉམ་བཞག་པ།
en: With the perfect meditation and definite knowledge of the sixth bhūmi,

source: །ཤེས་རབ་ཐབས་གཉིས་ཟུང་དུ་འབྲེལ་པ་མངོན་པར་བསྒྲུབ།
en: There is the accomplishment of the union of wisdom and method,

source: །མཁས་པས་བདུན་སྦྱོང་བ་དམ་པ་ཡོངས་སུ་གནོན།
en: And the wise ascend to the excellent conduct of the seventh bhūmi.

source: །སྟོང་པ་མཚན་མེད་མི་སྨོན་སྙིང་རྗེ་བྱམས་དང་ལྡན།
en: “They have attained emptiness, the absence of features, and the absence of aspiration, and are dedicated to compassion and love.

source: །ཆོས་ཉིད་མཉམ་པའི་རྗེས་འགྲོ་སངས་རྒྱས་མཆོད་པར་བྱེད།
en: They follow and make offerings to the Buddha’s Dharma and the sugatas.

source: །ཤེས་པས་ཤེས་བྱས་བསོད་ནམས་སྟོབས་ཀྱིས་མི་ངོམས་པས།
en: With wisdom, ever eager for the power of excellent great merit,

source: །དེའི་ཕྱིར་མཁས་པ་བདུན་པའི་ས་ཕྱོགས་ཡོངས་སུ་གནོན།
en: The wise ascend to the stage of the seventh bhūmi.

source: །ཁམས་གསུམ་མངོན་པར་སྒྲུབ་བྱེད་ཤིན་ཏུ་དབེན་པ་ཐོབ།
en: “They have attained endurance and detachment in the three realms.

source: །ཉོན་མོངས་སྟོབས་རྣམས་ཞི་ཞིང་གྲོལ་བ་ཞི་ལ་མོས།
en: They have pacified the power of the kleśas and pacified worldly desires.

source: །མིག་ཡོར་སྒྱུ་མ་རྨི་ལམ་མི་གཉིས་ཆོས་སྤྱོད་ཀྱང་།
en: They act in the nonduality of phenomena as reflections, illusions, and dreams.

source: །སྙིང་རྗེ་ལས་སྤྱོད་སྟོན་པ་མཁས་པས་བདུན་པ་གནོན།
en: The wise ones manifest compassion and reach the seventh bhūmi.

source: །ནམ་མཁའི་བསམ་པས་ཞིང་རྣམས་ཡོངས་སྦྱོང་རྣམ་མི་རྟོག །རྒྱལ་བའི་མཚན་དང་ལྡན་ཞིང་མི་གཡོ་ཆོས་དང་ལྡན།
en: “Without thought they purify realms perceived as space. They possess the characteristics of the jinas and do not waver from the true nature.

source: །བརྗོད་པའི་དབྱངས་བྲལ་འགྲོ་བ་དགར་བྱ་དོན་དུ་གཉེར།
en: Inexpressible, without sound, they bring happiness to beings.

source: །སྐད་ཅིག་སེམས་ཀྱིས་རྒྱལ་བས་ཀུན་མཁྱེན་ཡང་དག་གཞོལ།
en: They comprehend the instantaneous wisdom in the mind of the jinas.

source: །ཆོས་རྣམས་འདི་དག་སྤྱད་པས་སྣང་བ་ཐོབ་གྱུར་པས།
en: “They practice the Dharma and attain illumination.

source: །འགྲོ་བའི་དོན་འདོད་ས་མཆོག་ཡོངས་སུ་གནོན་ཅེས་བྱ།
en: They ascend to the excellent bhūmi and benefit beings.

source: །དེ་དག་ས་འདི་གནས་ཤིང་མཐའ་ཡས་སེམས་ཅན་སྤྱོད།
en: They reside on this bhūmi and have limitless actions for beings.

source: །བདེ་གཤེགས་ཚད་མེད་ལས་མཁྱེན་རྣམ་པར་དཔྱོད་པ་བྱེད།
en: They contemplate the actions of countless myriads of sugatas,

source: །ཞིང་དང་བསྐལ་པ་ཆོས་གྲངས་སྣ་ཚོགས་དུ་མ་དང་། །མོས་དང་བསམ་པ་སེམས་དང་སྤྱོད་པ་སྣ་ཚོགས་དང་། །ཐེག་པ་གསུམ་པོ་བསྟན་པ་ཚད་མེད་ཡང་དག་འཇུག །བདག་གིས་སེམས་ཅན་དེ་དག་ཡོངས་སུ་སྨིན་བྱ་ཞེས།
en: “A multitude of various realms, dharmas, eons, and numbers, And the possession of various motivations, aspirations, and intentions. They comprehend limitless teachings of the three yānas. They say, ‘It is for us to ripen these beings.’

source: །དེ་དག་དེ་ལྟར་རྣམ་ཕྱེ་ཤེས་རབ་ལམ་ལྡན་པ།
en: “They have wisdom’s analysis and have gained the supreme path.

source: །སྤྱོད་ལམ་བཞི་པོར་མངོན་པར་བརྩོན་ཞིང་ཐབས་དང་ལྡན།
en: They have wisdom united with method in the four physical activities.

source: །སེམས་ཀྱི་སྐད་ཅིག་ཀུན་ལ་བྱང་ཆུབ་ཡོན་ཏན་སྒྲུབ།
en: In all the mind’s moments, they accomplish the qualities of enlightenment

source: །ཕ་རོལ་ཕྱིན་པ་བཅུར་འཇུག་ཡོངས་སུ་རྫོགས་པར་བྱེད།
en: And complete the states of the ten perfections:

source: །སེམས་སྐྱེས་འགྲོ་ལ་ཡོངས་སྔོ་དེ་ནི་སྦྱིན་པའོ།
en: “Their generosity is that their bodhicitta is dedicated to all.
